In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
cu = pd.read_csv("Customers.csv",sep = ";")
ord = pd.read_csv("orders.csv",sep = ";")
pro = pd.read_csv("products.csv",sep = ";")

In [4]:
# change first name as customer name
cu = cu.rename(columns={"First_Name":"Customer_Name"})
cu.head(2)

,Customer_ID,Customer_Name,Last_Name,Postal_Code,City,Country,Score
0,1,Bill,Van Buren,78000,Versailles,France,76
1,2,Gerald,Jackson,60528,Frankfurt a.M.,Germany,74

In [5]:
# CONVERTNG TO UPPER
cu['Customer_Name'] =  cu['Customer_Name'].str.upper()
cu.head(2)

,Customer_ID,Customer_Name,Last_Name,Postal_Code,City,Country,Score
0,1,BILL,Van Buren,78000,Versailles,France,76
1,2,GERALD,Jackson,60528,Frankfurt a.M.,Germany,74

In [6]:
# UNIQ CUSTOMERS
uniq = cu['Customer_Name'].unique()
uniq

array(['BILL', 'GERALD', 'HARRY', 'DWIGHT', 'RUTHERFORD', 'GROVER',
       'CALVIN', 'ULYSSES', 'JIMMY', 'JAMES', 'RONALD', 'MARTIN', 'JOHN',
       'FRANKLIN', 'BENJAMIN', 'CHESTER', 'WARREN', 'MILLARD', 'HERBERT',
       'WOODROW', 'ANDREW', 'RICHARD', 'ZACHARY', 'THOMAS', 'WILLIAM',
       'ABRAHAM', 'GEORGE', 'THEODORE', 'LYNDON'], dtype=object)

In [7]:
# FIRST 3 CHAR similary other charactier s can be extracted
cu['first_3'] = cu['Customer_Name'].str[:3]

In [8]:
# trim in 
df['RTRIM_NAMe'] = df['Customer_Name'].str.rstrip()
df['lTRIM_NAMe'] = df['Customer_Name'].str.lstrip()
df['lTRIM_NAMe'] = df['Customer_Name'].str.strip()

NameError: name 'df' is not defined

In [ ]:
# removing spaces in between
df['NO_SPACES'] = df['FULL_NAME'].str.replace(" ", "", regex=False)

In [ ]:
# find character
cu["find R"] = cu["Customer_Name"].str.find('R')+1 # since zero based indexing
cu.head()

In [ ]:
# distinct withcu length Because .drop_duplicates() behaves differently depending on the type:
#If you use a Series, it'll drop duplicate values in that Series only.
#If you use a DataFrame, you can preserve the full 2D structure, which is useful when selecting multiple columns (even if it's just one now).

cu_dist = cu[["City"]].drop_duplicates()
cu_dist["count"] = cu_dist["City"].str.len()
cu_dist[:]
cu_dist_order = cu_dist.sort_values(by='count', ascending=False)
cu_dist_order.iloc[:5,:1]

In [ ]:
cu['COMPLETE_NAME'] = cu['Customer_Name'] + " " + cu['Last_Name']

In [ ]:
# ISIN 
fil_cu = cu[cu['Customer_Name'].isin(['BILL','HARRY'])]
# not in
fil_cu_no = cu[~cu['Customer_Name'].isin(['BILL','HARRY'])]

In [23]:
# first name contains A 
filter_cu = cu[cu['Last_Name'].str.contains('A',case=False)]
filter_cu.head()

,Customer_ID,Customer_Name,Last_Name,Postal_Code,City,Country,Score,first_3
0,1,BILL,Van Buren,78000,Versailles,France,76,BIL
1,2,GERALD,Jackson,60528,Frankfurt a.M.,Germany,74,GER
5,6,GROVER,Grant,80805,München,Germany,65,GRO
10,11,ULYSSES,Harding,75016,Paris,France,50,ULY
11,12,RUTHERFORD,Garfield,70563,Stuttgart,Germany,79,RUT

In [53]:
# fist name last letter R 
filter_cu = cu[cu["Last_Name"].str.endswith('eR',False)] # case sensitive
filter_cu.head()
filter_cu = cu[cu["Last_Name"].str.lower().str.endswith('eR',False)]

Empty DataFrame
Columns: [Customer_ID, Customer_Name, Last_Name, Postal_Code, City, Country, Score, first_3]
Index: []

In [59]:
#whose FIRST_NAME ends with ‘h’ and contains six alphabets.
fil_cu = cu[(cu["Last_Name"].str.len()==7) & (cu["Last_Name"].str.endswith("g"))]
fil_cu.head()

,Customer_ID,Customer_Name,Last_Name,Postal_Code,City,Country,Score,first_3
10,11,ULYSSES,Harding,75016,Paris,France,50,ULY
64,65,HARRY,Harding,97827,Elgin,USA,1,HAR
79,80,WILLIAM,Harding,59000,Lille,France,3,WIL
83,84,THOMAS,Harding,69004,Lyon,France,43,THO
142,143,HARRY,Harding,75012,Paris,France,20,HAR

In [65]:
fil_cu = cu[(cu["Score"] >=25) & (cu["Score"] <=40)]
fil_cu.head()

,Customer_ID,Customer_Name,Last_Name,Postal_Code,City,Country,Score,first_3
3,4,DWIGHT,Coolidge,97219,Portland,USA,25,DWI
7,8,BILL,Roosevelt,82520,Lander,USA,27,BIL
13,14,JAMES,Roosevelt,24100,Bergamo,Italy,27,JAM
20,21,FRANKLIN,Johnson,44000,Nantes,France,38,FRA
25,26,HARRY,Truman,52066,Aachen,Germany,36,HAR

In [73]:
fil_france = cu[cu["Country"]=="France"].shape[0]
fil_france

246